/* 
Цельсій у Фаренгейт
Формула для конвертації Цельсію у Фаренгейт: температура в Цельсіях × 9/5 + 32.
Вам надано змінну celsius, яка відповідає температурі за Цельсієм. Використайте вже визначену змінну fahrenheit та призначте
 їй температуру за Фаренгейтом, еквівалентну заданій температурі за Цельсієм. Використайте запропоновану вище формулу для 
 конвертації температури за Цельсієм у температуру за Фаренгейтом.
 */

function convertCtoF(celsius) {
  let fahrenheit = celsius * (9 / 5) + 32;
  return fahrenheit;
}

// Change the inputs below to test your code
convertCtoF(30);

//******************************************************************************************************************************
/*
Зворотний рядок
Переверніть наданий рядок та поверніть рядок у зворотньому порядку.

Наприклад, "hello" повинен стати "olleh". 
 */

function reverseString(str) {
  return str.split("").reverse().join("");
}

reverseString("hello");
//******************************************************************************************************************************
/* Факторизація числа
Поверніть факторіал поданого цілого числа.

Якщо ціле число позначається літерою n, то факторіал — це добуток усіх додатних цілих чисел, менших або рівних n.

Факторіали часто зображаються короткими позначеннями n!

Наприклад: 5! = 1 * 2 * 3 * 4 * 5 = 120

Функції будуть задані тільки ті цілі числа, які більші або дорівнюють нулю. */
//loop solution
// function factorialize(num) {
//   let product = 1;
//   for (let i = 2; i <= num; i++) {
//     product *= i;
//   }
//   return product;
// }

// factorialize(5);

//recursive solution
function factorialize(num) {
  if (num <= 0) {
    return 1;
  }
  return num * factorialize(num - 1);
}

factorialize(5);
//******************************************************************************************************************************
