/* 
Цельсій у Фаренгейт
Формула для конвертації Цельсію у Фаренгейт: температура в Цельсіях × 9/5 + 32.
Вам надано змінну celsius, яка відповідає температурі за Цельсієм. Використайте вже визначену змінну fahrenheit та призначте
 їй температуру за Фаренгейтом, еквівалентну заданій температурі за Цельсієм. Використайте запропоновану вище формулу для 
 конвертації температури за Цельсієм у температуру за Фаренгейтом.
 */

function convertCtoF(celsius) {
  let fahrenheit = celsius * (9 / 5) + 32;
  return fahrenheit;
}

// Change the inputs below to test your code
convertCtoF(30);

//******************************************************************************************************************************
/*
Зворотний рядок
Переверніть наданий рядок та поверніть рядок у зворотньому порядку.

Наприклад, "hello" повинен стати "olleh". 
 */

function reverseString(str) {
  return str.split("").reverse().join("");
}

reverseString("hello");
